In [1]:
import numpy as np
import pandas as pd

In [2]:
data=np.random.randn(4,3)

In [3]:
data

array([[-1.34323731,  0.96119648, -1.0500808 ],
       [ 1.64365489,  0.28684027, -0.19039583],
       [ 1.02737148, -0.00722666, -0.44768511],
       [-0.58978616, -1.17772364, -0.11705659]])

In [4]:
dataFrame=pd.DataFrame(data)

In [5]:
type(dataFrame[0])

pandas.core.series.Series

In [6]:
dataFrame

          0         1         2
0 -1.343237  0.961196 -1.050081
1  1.643655  0.286840 -0.190396
2  1.027371 -0.007227 -0.447685
3 -0.589786 -1.177724 -0.117057

In [7]:
yeniDataFrame=pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calısma Saati"])

In [8]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atil   -1.343237  0.961196      -1.050081
Zeynep  1.643655  0.286840      -0.190396
Atlas   1.027371 -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [9]:
yeniDataFrame["Yas"]

Atil      0.961196
Zeynep    0.286840
Atlas    -0.007227
Mehmet   -1.177724
Name: Yas, dtype: float64

In [10]:
yeniDataFrame["Calısma Saati"]

Atil     -1.050081
Zeynep   -0.190396
Atlas    -0.447685
Mehmet   -0.117057
Name: Calısma Saati, dtype: float64

In [11]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil   -1.343237  0.961196
Zeynep  1.643655  0.286840
Atlas   1.027371 -0.007227
Mehmet -0.589786 -1.177724

In [12]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atil   -1.343237  0.961196      -1.050081
Zeynep  1.643655  0.286840      -0.190396
Atlas   1.027371 -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [13]:
yeniDataFrame.loc["Atil"]

Maas            -1.343237
Yas              0.961196
Calısma Saati   -1.050081
Name: Atil, dtype: float64

In [14]:
yeniDataFrame.loc["Zeynep"]

Maas             1.643655
Yas              0.286840
Calısma Saati   -0.190396
Name: Zeynep, dtype: float64

In [15]:
yeniDataFrame.iloc[1]

Maas             1.643655
Yas              0.286840
Calısma Saati   -0.190396
Name: Zeynep, dtype: float64

In [16]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atil   -1.343237  0.961196      -1.050081
Zeynep  1.643655  0.286840      -0.190396
Atlas   1.027371 -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [17]:
yeniDataFrame["Emeklilik Yasi"]=yeniDataFrame["Yas"]+yeniDataFrame["Yas"]

In [19]:
yeniDataFrame

            Maas       Yas  Calısma Saati  Emeklilik Yasi
Atil   -1.343237  0.961196      -1.050081        1.922393
Zeynep  1.643655  0.286840      -0.190396        0.573681
Atlas   1.027371 -0.007227      -0.447685       -0.014453
Mehmet -0.589786 -1.177724      -0.117057       -2.355447

In [21]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

            Maas       Yas  Calısma Saati
Atil   -1.343237  0.961196      -1.050081
Zeynep  1.643655  0.286840      -0.190396
Atlas   1.027371 -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [23]:
yeniDataFrame.drop("Mehmet")

            Maas       Yas  Calısma Saati  Emeklilik Yasi
Atil   -1.343237  0.961196      -1.050081        1.922393
Zeynep  1.643655  0.286840      -0.190396        0.573681
Atlas   1.027371 -0.007227      -0.447685       -0.014453

In [24]:
yeniDataFrame

            Maas       Yas  Calısma Saati  Emeklilik Yasi
Atil   -1.343237  0.961196      -1.050081        1.922393
Zeynep  1.643655  0.286840      -0.190396        0.573681
Atlas   1.027371 -0.007227      -0.447685       -0.014453
Mehmet -0.589786 -1.177724      -0.117057       -2.355447

In [25]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [26]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atil   -1.343237  0.961196      -1.050081
Zeynep  1.643655  0.286840      -0.190396
Atlas   1.027371 -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [28]:
yeniDataFrame.loc["Atil"]["Maas"]

-1.3432373068518002

In [29]:
yeniDataFrame.loc["Atlas","Yas"]

-0.007226657567597898

In [30]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atil   -1.343237  0.961196      -1.050081
Zeynep  1.643655  0.286840      -0.190396
Atlas   1.027371 -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [33]:
booleanFrame=yeniDataFrame<0

In [34]:
booleanFrame

         Maas    Yas  Calısma Saati
Atil     True  False           True
Zeynep  False  False           True
Atlas   False   True           True
Mehmet   True   True           True

In [35]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calısma Saati
Atil   -1.343237       NaN      -1.050081
Zeynep       NaN       NaN      -0.190396
Atlas        NaN -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [36]:
yeniDataFrame[yeniDataFrame<0]

            Maas       Yas  Calısma Saati
Atil   -1.343237       NaN      -1.050081
Zeynep       NaN       NaN      -0.190396
Atlas        NaN -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [38]:
yeniDataFrame[yeniDataFrame["Yas"]>0]

            Maas       Yas  Calısma Saati
Atil   -1.343237  0.961196      -1.050081
Zeynep  1.643655  0.286840      -0.190396

In [39]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atil   -1.343237  0.961196      -1.050081
Zeynep  1.643655  0.286840      -0.190396
Atlas   1.027371 -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [41]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calısma Saati
0    Atil -1.343237  0.961196      -1.050081
1  Zeynep  1.643655  0.286840      -0.190396
2   Atlas  1.027371 -0.007227      -0.447685
3  Mehmet -0.589786 -1.177724      -0.117057

In [58]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atil   -1.343237  0.961196      -1.050081
Zeynep  1.643655  0.286840      -0.190396
Atlas   1.027371 -0.007227      -0.447685
Mehmet -0.589786 -1.177724      -0.117057

In [59]:
yeniIndeksListesi=["Ati","Zey","Atl","Meh"]

In [60]:
yeniDataFrame["Yeni Indeks"]=yeniIndeksListesi

In [61]:
yeniDataFrame

            Maas       Yas  Calısma Saati Yeni Indeks
Atil   -1.343237  0.961196      -1.050081         Ati
Zeynep  1.643655  0.286840      -0.190396         Zey
Atlas   1.027371 -0.007227      -0.447685         Atl
Mehmet -0.589786 -1.177724      -0.117057         Meh

In [63]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [64]:
yeniDataFrame

                 Maas       Yas  Calısma Saati
Yeni Indeks
Ati         -1.343237  0.961196      -1.050081
Zey          1.643655  0.286840      -0.190396
Atl          1.027371 -0.007227      -0.447685
Meh         -0.589786 -1.177724      -0.117057

In [65]:
yeniDataFrame.loc["Ati"]

Maas            -1.343237
Yas              0.961196
Calısma Saati   -1.050081
Name: Ati, dtype: float64

In [66]:
ilkIndeksler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [67]:
icIndeksler=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [68]:
birlesmisIndeks=list(zip(ilkIndeksler,icIndeksler))

In [69]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [70]:
birlesmisIndeks=pd.MultiIndex.from_tuples(birlesmisIndeks)

In [71]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [72]:
benimCizgiFilmListem=[[40,"A"],[30,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [77]:
cizgiFilmNumpyDizisi=np.array(benimCizgiFilmListem)

In [78]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [79]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     30      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [80]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   30      B
Marge  30      C

In [81]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [82]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     30      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [83]:
cizgiFilmDataFrame.index.names=["Film Adi","İsim"]

In [84]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adi   İsim
Simpson    Homer    40      A
           Bart     30      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F